<?php
function furl($url)
{
    return url('/storage/' . $url);
}

function get_js_link($name)
{
    $urls = [
        'photo' => asset('js/photo.js') . '?v=2',
        'photo-btn' => asset('js/photo-btn.js') . '?v=1',
        'ad-download' => asset('js/ad-download.js') . '?v=1',
        'ad-form' => asset('js/ad-form.js') . '?v=1',
        'app' => asset('js/app.js') . '?v=1',
        'create_order' => asset('js/create_order.js') . '?v=1',
        'home' => asset('js/home.js') . '?v=1',
        'ticket' => asset('js/ticket.js') . '?v=1'
    ];
    return isset($urls[$name])?$urls[$name]:'';
}

function get_css_link($name){
    $urls = [
      'app'=>  asset('css/app.css') . '?v=1'
    ];
    return isset($urls[$name])?$urls[$name]:'';
}
function types($arg)
{
    $types = [
        "در حال بررسی" => 'btn-gray',
        "در حال انجام" => 'btn-gray',
        "انجام شد" => 'btn-gradient-no-width',
        "انجام نشد" => 'btn-fail',
        "دریافت شد" => 'btn-off',
        "جواب داده نشد" => 'btn-off',
        "جواب داده شد" => 'btn-gradient-no-width',
        "جدید" => "btn-gradient-no-width",
        "خوانده شد" => "btn-off",
        "not completed" => 'btn-gray',
        "not answered" => 'btn-off',
        "completed" => 'btn-gradient-no-width'


    ];
    if (isset($types[$arg]))
        return $types[$arg];
    return 'btn-gray';
}

function description($title)
{
    $desc = [
        'designs' =>
            'در این بخش می توانید یکی از نمونه طرح های ما را انتخاب کنید و سپس آن را به طور دلخواه شخصی سازی کنید و فایل نهایی را دریافت کنید.',

        'orders-div' =>
            'در این بخش میتوانید پروژه های سفارش داده شده توسط خودتان را مدیریت کنید و فایل پروژه های انجام شده را دریافت کنید.',

        'notification-div' =>
            'در این بخش اعلان ها و جواب تیکت های شما به صورت موقت و برای دسترسی بهتر و سریعتر قرار میگیرند. توجه فرمایید که بعد از ۲۴ ساعت موارد خوانده شده از لیست حذف خواهند شد.',

        'account-div' =>
            'در این بخش نوع حساب کاربری شما نمایش داده می شود. حالت پیش فرض حساب کاربری حالت محدود می باشد که در این حالت شما توانایی سفارش یک پروژه را در روز دریافت می کنید.
برای افزایش تعداد سفارش های خود حساب خود را ارتقاء دهید.',

        'new-ticket' =>
            'در این بخش می توانید سوالی مطرح کنید تا مدیریت وبسایت پاسخ آن را در اسرع وقت برای شما ارسال کند.',

        'art' =>
            'موارد خواسته شده را پر کنید تا سیستم ما پروژه شما را آنچنان که شخصی سازی کرده آید انجام دهد در صورت تمایل یه حذف موارد آن ها را خالی بگذارید. سفارشات شما در اسرع وقت به انجام در می آیند برای مدیریت سفارشات از بخش سفارشات شما در صفحه خانه استفاده فرمایید',
        'privacy policy' =>
            'شما با پذیرفتن شرایط زیر مجاز به ثبت سفارش در سامانه طراحی گرافیک و ویرایش تصاویر مجیکا خواهید بود.<br>
سرویس مجیکا سرویس قابل اعتمادی برای تصاویر و اطلاعات آپلود شده توسط شما می‌باشد اما در صورت فاحش شدن تصاویر و اطلاعات مجیکا هیچ گونه مسئولیتی در قبال سفارش دهنده بر عهده نمی گیرد.<br>
درصورت به هم ریختگی شکل ظاهری پروژه به دلیل کم یا زیاد بودن متن استفاده شده راهی برای اصلاح و پس گرفتن حق سفارش موجود نمی باشد و یک سفارش موفق محسوب خواهد شد و در قبال چنین اتفاقاتی مسئولیتی بر گردن مجیکا نخواهد بود. لطفاً به هنگام پر کردن فرم دقت فرمایید.<br>
درصورت پایین بودن کیفیت تصاویر آپلودی و مناسب نبودن آنها برای طرح انتخابی‌ مسئولیتی گردن سامانه مجیکا نمی باشد و کاربر باید به کیفیت تصاویر آپلودی توجه کند تا مشکلی پیش نیاید.<br>
سفارش هایی که دارای مصادیق غیر اسلامی و اخلاقی باشند انجام نخواهند شد.<br>
درصورت وجود مشکل در طراحی اگر مشکل از سامانه باشد مجیکا طرح را دوباره طراحی می‌کند و امکان بازگشت حق سفارش وجود ندارد.<br>
در سفارش های بخش ویرایش عکس، عکس آپلودی در زیبایی طرح و قابلیت اجرای آن تاثیر بسزایی دارد و درصورت آپلود عکس نامناسب حق سفارش کسر خواهد شد و سامانه مجیکا مسئولیتی در قبال بد شدن طرح بر گردن نمی گیرد. کاربر باید مثل عکس منبع عکس خود را آپلود کند تا این گونه مشکلات پیش نیایند'
    ];
    return $desc[$title];
}

function cost($number)
{
    return fa_number(substr(strrev(chunk_split(strrev($number), 3, ',')), 1));


}

function fa_number($number)
{
    $en = array("0", "1", "2", "3", "4", "5", "6", "7", "8", "9");
    $fa = array("۰", "۱", "۲", "۳", "۴", "۵", "۶", "۷", "۸", "۹");
    return str_replace($en, $fa, $number);
}



